In [1]:
%run "../LOS.ipynb"

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
df = dreams_mastersheet

In [3]:
date_du_jour = datetime.today().strftime("%d_%m_%Y")

# La cohort des beneficaires

In [32]:
base = df[
    (df.age_range!="not_valid_age")
    &(df.age_range!="25-29")
    &(df.timeOn_system=="required_Time_on")
]
base.code.count()
base_table = base.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
base_table

19193

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           911     796     685     297           5080         7769
15-19           993     679     405     182           5263         7522
20-24           515     330     182      76           2799         3902
Grand Total    2419    1805    1272     555          13142        19193

In [35]:
base18plus = df[
    (df.newage_range!="not_valid_age")
    &(df.newage_range!="25-29")
    &(df.newage_range!="10-17")
    &(df.timeOn_system=="required_Time_on")
]
base18plus.code.count()
base18plus_table = base18plus.pivot_table(index="newage_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
base18plus_table

6402

fiscal_year   FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
newage_range
18-19            337     231     122      50           1760         2500
20-24            515     330     182      76           2799         3902
Grand Total      852     561     304     126           4559         6402

# curriculum

In [6]:
curriculum_complet = base[
    (base.dreams_curriculum=="curriculum_completed")
]
curriculum_complet.code.count()

16065

In [7]:
curriculum_table = curriculum_complet.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
curriculum_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           725     612     561     207           4347         6452
15-19           799     503     345     157           4499         6303
20-24           402     262     135      63           2448         3310
Grand Total    1926    1377    1041     427          11294        16065

# Condoms

In [8]:
condoms = base[
    (base.condoms=="tested_on_given_date")
]

condoms.code.count()

new_condoms = base[
    (base.new_condoms=="sensOuRecu")
]

new_condoms.code.count()

3263

3499

In [9]:
condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            82     101      42      24            222          471
15-19           306     171     129      63            971         1640
20-24           235      90      55      24            748         1152
Grand Total     623     362     226     111           1941         3263

In [10]:
condoms_table = new_condoms.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
condoms_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            82     106      83      45            238          554
15-19           320     203     151      65           1006         1745
20-24           246     113      60      24            757         1200
Grand Total     648     422     294     134           2001         3499

# depistage VIH

In [11]:
vih = base[
    (base.hts=="tested_on_given_date")
]
vih.code.count()

1969

In [12]:
depistage_table = vih.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
depistage_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14            33      10      21       1            386          451
15-19            90      25      26       4            648          793
20-24           154      25      31       6            509          725
Grand Total     277      60      78      11           1543         1969

# Post Care Treatment

In [13]:
post_violence_care = base[
    (base.post_care_treatment=="service_gyneco_vbg")
]
post_violence_care.code.count()

85

In [14]:
pvc_table = post_violence_care.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
pvc_table

fiscal_year  FY21Q1  FY21Q2  Q3fy20-Q4fy20  Grand Total
age_range
10-14             3       0             16           19
15-19             3       1             35           39
20-24             0       0             27           27
Grand Total       6       1             78           85

# socio economique Approche

In [15]:
combin_socio_eco =  base[
    (base.socio_eco_app=="service_muso_gardening")
]

combin_socio_eco.code.count()

407

In [16]:
cse_table= combin_socio_eco.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
cse_table

fiscal_year  FY21Q3  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0            136          136
15-19             1            146          147
20-24             0            124          124
Grand Total       1            406          407

# PREP

In [30]:
prep_sens = base[
    (base.sens_prep=="tested_on_given_date")
]
prep_sens.code.count()

prep_sens_table = prep_sens.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_sens_table

500

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14             1       1       6       0             15           23
15-19            45      17      38       0             75          175
20-24           114      16      33       3            136          302
Grand Total     160      34      77       3            226          500

In [27]:
prep_accept = base[
    (base.acc_prep=="accept")
]
prep_accept.code.count()
prep_accept_table = prep_accept.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_accept_table

39

fiscal_year  FY21Q1  FY21Q2  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0              4            4
15-19             5       0             12           17
20-24             6       2             10           18
Grand Total      11       2             26           39

In [28]:
prep_ref = base[
    (base.ref_prep=="tested_on_given_date")
]
prep_ref.code.count()
prep_ref_table = prep_ref.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_ref_table

38

fiscal_year  FY21Q1  FY21Q2  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0              4            4
15-19             4       0             12           16
20-24             6       2             10           18
Grand Total      10       2             26           38

In [31]:

prep = base[
    (base.init_prep=="tested_on_given_date")
]
prep.code.count()

prep_table = prep.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
prep_table

34

fiscal_year  FY21Q1  FY21Q2  Q3fy20-Q4fy20  Grand Total
age_range
10-14             0       0              4            4
15-19             4       0             10           14
20-24             6       2              8           16
Grand Total      10       2             22           34

# Primary Services

In [21]:
ps14 = base[
    (base.ps_10_14=="curriculum-servis")
]
ps14.code.count()

ps19 = base[
    (base.ps_15_19=="condoms&curriculum")
]
ps19.code.count()

ps24 = base[
    (base.ps_20_24=="condoms&curriculum")
]
ps24.code.count()

6452

1570

1085

In [22]:
ps14_table = ps14.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps14_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
10-14           725     612     561     207           4347         6452
Grand Total     725     612     561     207           4347         6452

In [23]:

ps19_table= ps19.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps19_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
15-19           295     163     143      55            914         1570
Grand Total     295     163     143      55            914         1570

In [24]:
ps24_table = ps24.pivot_table(index="age_range",columns="fiscal_year",
                        values='code',
                        aggfunc='count',
                        fill_value=0,
                        margins=True,
                        margins_name="Grand Total"                             
)
ps24_table

fiscal_year  FY21Q1  FY21Q2  FY21Q3  FY21Q4  Q3fy20-Q4fy20  Grand Total
age_range
20-24           220      93      46      21            705         1085
Grand Total     220      93      46      21            705         1085

# reporting

In [25]:
table_report = pd.ExcelWriter(f"DREAMS_services_Quarter_enroled_{date_du_jour}.xlsx",engine="xlsxwriter")
ps14_table.to_excel(table_report,sheet_name="ps14_table",index=True,na_rep="NULL")
ps19_table.to_excel(table_report,sheet_name="ps19_table",index=True,na_rep="NULL")
ps24_table.to_excel(table_report,sheet_name="ps24_table",index=True,na_rep="NULL")
prep_table.to_excel(table_report,sheet_name="prep_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
prep_sens_table.to_excel(table_report,sheet_name="prep_sens_table",index=True,na_rep="NULL")
cse_table.to_excel(table_report,sheet_name="cse_table",index=True,na_rep="NULL")
pvc_table.to_excel(table_report,sheet_name="pvc_table",index=True,na_rep="NULL")
depistage_table.to_excel(table_report,sheet_name="depistage_table",index=True,na_rep="NULL")
condoms_table.to_excel(table_report,sheet_name="condoms_table",index=True,na_rep="NULL")
depistage_table.to_excel(table_report,sheet_name="depistage_table",index=True,na_rep="NULL")
curriculum_table.to_excel(table_report,sheet_name="curriculum_table",index=True,na_rep="NULL")
base_table.to_excel(table_report,sheet_name="base_table",index=True,na_rep="NULL")
table_report.save()